{"config": [{"config": {"name": "conv2d_1", "strides": [1, 1], "padding": "same", "data_format": "channels_last", "kernel_initializer": {"config": {"mode": "fan_avg", "distribution": "uniform", "scale": 1.0, "seed": null}, "class_name": "VarianceScaling"}, "dilation_rate": [1, 1], "use_bias": true, "trainable": true, "activity_regularizer": null, "kernel_regularizer": null, "bias_regularizer": null, "dtype": "float32", "filters": 32, "bias_constraint": null, "activation": "relu", "bias_initializer": {"config": {}, "class_name": "Zeros"}, "kernel_size": [5, 5], "kernel_constraint": null, "batch_input_shape": [null, 28, 28, 1]}, "class_name": "Conv2D"}, {"config": {"name": "conv2d_2", "kernel_initializer": {"config": {"mode": "fan_avg", "distribution": "uniform", "scale": 1.0, "seed": null}, "class_name": "VarianceScaling"}, "padding": "same", "data_format": "channels_last", "strides": [1, 1], "bias_regularizer": null, "use_bias": true, "trainable": true, "activity_regularizer": null, "kernel_regularizer": null, "kernel_size": [5, 5], "dilation_rate": [1, 1], "filters": 32, "bias_constraint": null, "activation": "relu", "bias_initializer": {"config": {}, "class_name": "Zeros"}, "kernel_constraint": null}, "class_name": "Conv2D"}, {"config": {"trainable": true, "name": "max_pooling2d_1", "strides": [2, 2], "padding": "valid", "data_format": "channels_last", "pool_size": [2, 2]}, "class_name": "MaxPooling2D"}, {"config": {"trainable": true, "noise_shape": null, "name": "dropout_1", "rate": 0.25, "seed": null}, "class_name": "Dropout"}, {"config": {"name": "conv2d_3", "kernel_initializer": {"config": {"mode": "fan_avg", "distribution": "uniform", "scale": 1.0, "seed": null}, "class_name": "VarianceScaling"}, "padding": "same", "data_format": "channels_last", "strides": [1, 1], "bias_regularizer": null, "use_bias": true, "trainable": true, "activity_regularizer": null, "kernel_regularizer": null, "kernel_size": [3, 3], "dilation_rate": [1, 1], "filters": 64, "bias_constraint": null, "activation": "relu", "bias_initializer": {"config": {}, "class_name": "Zeros"}, "kernel_constraint": null}, "class_name": "Conv2D"}, {"config": {"name": "conv2d_4", "kernel_initializer": {"config": {"mode": "fan_avg", "distribution": "uniform", "scale": 1.0, "seed": null}, "class_name": "VarianceScaling"}, "padding": "same", "data_format": "channels_last", "strides": [1, 1], "bias_regularizer": null, "use_bias": true, "trainable": true, "activity_regularizer": null, "kernel_regularizer": null, "kernel_size": [3, 3], "dilation_rate": [1, 1], "filters": 64, "bias_constraint": null, "activation": "relu", "bias_initializer": {"config": {}, "class_name": "Zeros"}, "kernel_constraint": null}, "class_name": "Conv2D"}, {"config": {"trainable": true, "name": "max_pooling2d_2", "strides": [2, 2], "padding": "valid", "data_format": "channels_last", "pool_size": [2, 2]}, "class_name": "MaxPooling2D"}, {"config": {"trainable": true, "noise_shape": null, "name": "dropout_2", "rate": 0.25, "seed": null}, "class_name": "Dropout"}, {"config": {"name": "conv2d_5", "kernel_initializer": {"config": {"mode": "fan_avg", "distribution": "uniform", "scale": 1.0, "seed": null}, "class_name": "VarianceScaling"}, "padding": "same", "data_format": "channels_last", "strides": [1, 1], "bias_regularizer": null, "use_bias": true, "trainable": true, "activity_regularizer": null, "kernel_regularizer": null, "kernel_size": [3, 3], "dilation_rate": [1, 1], "filters": 128, "bias_constraint": null, "activation": "relu", "bias_initializer": {"config": {}, "class_name": "Zeros"}, "kernel_constraint": null}, "class_name": "Conv2D"}, {"config": {"name": "conv2d_6", "kernel_initializer": {"config": {"mode": "fan_avg", "distribution": "uniform", "scale": 1.0, "seed": null}, "class_name": "VarianceScaling"}, "padding": "same", "data_format": "channels_last", "strides": [1, 1], "bias_regularizer": null, "use_bias": true, "trainable": true, "activity_regularizer": null, "kernel_regularizer": null, "kernel_size": [3, 3], "dilation_rate": [1, 1], "filters": 128, "bias_constraint": null, "activation": "relu", "bias_initializer": {"config": {}, "class_name": "Zeros"}, "kernel_constraint": null}, "class_name": "Conv2D"}, {"config": {"trainable": true, "name": "max_pooling2d_3", "strides": [2, 2], "padding": "valid", "data_format": "channels_last", "pool_size": [2, 2]}, "class_name": "MaxPooling2D"}, {"config": {"trainable": true, "noise_shape": null, "name": "dropout_3", "rate": 0.25, "seed": null}, "class_name": "Dropout"}, {"config": {"trainable": true, "name": "flatten_1"}, "class_name": "Flatten"}, {"config": {"name": "dense_1", "activation": "relu", "units": 256, "kernel_initializer": {"config": {"mode": "fan_avg", "distribution": "uniform", "scale": 1.0, "seed": null}, "class_name": "VarianceScaling"}, "bias_regularizer": null, "use_bias": true, "trainable": true, "bias_constraint": null, "kernel_regularizer": null, "activity_regularizer": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "kernel_constraint": null}, "class_name": "Dense"}, {"config": {"trainable": true, "noise_shape": null, "name": "dropout_4", "rate": 0.5, "seed": null}, "class_name": "Dropout"}, {"config": {"name": "dense_2", "activation": "softmax", "units": 10, "kernel_initializer": {"config": {"mode": "fan_avg", "distribution": "uniform", "scale": 1.0, "seed": null}, "class_name": "VarianceScaling"}, "bias_regularizer": null, "use_bias": true, "trainable": true, "bias_constraint": null, "kernel_regularizer": null, "activity_regularizer": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "kernel_constraint": null}, "class_name": "Dense"}], "class_name": "Sequential", "backend": "theano", "keras_version": "2.1.4"}